In [1]:
#Lab SQL Queries 9, 02.12.2022

#Create a Python connection with SQL database and retrieve the results of the following queries as #dataframes:

# 1. How many distinct (different) actors' last names are there?
# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the
# rental day of the week.
# 3. Get all films with ARMAGEDDON in the title.
# 4. Get 10 the longest films.
# 5. How many films include Behind the Scenes content?
# 6. Which kind of movies (rating) have a mean duration of more than two hours?
# 7 . Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, 
# only select the columns title, length, and the rank.

In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from getpass import getpass  # To get the password without showing the input

In [2]:
password = getpass()

········

In [4]:
type(engine)

NameError: name 'engine' is not defined

In [ ]:
# 
# connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
# engine = create_engine(connection_string)
# data = pd.read_sql_query('SELECT * FROM loan', engine)
# data.head()

In [9]:
# 1. How many distinct (different) actors' last names are there?

In [12]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)
data = pd.read_sql_query('SELECT * FROM sakila.actor', engine)
data.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [34]:
query1 = "SELECT COUNT(DISTINCT last_name) AS distinct_lastnames FROM actor;"

In [35]:
data1 = pd.read_sql_query(query1, engine)
data1.head(1)

   distinct_lastnames
0                 121

In [ ]:
# 2. Add an additional column day_type with values 'weekend' and 'workday' depending on the
# rental day of the week.

In [15]:
query2 = '''SELECT *, MONTHNAME(rental_date) AS month,
DAYNAME(rental_date) AS weekday,
CASE
WHEN dayname(rental_date)
IN ('Saturday', 'Sunday')
THEN 'Weekend'
ELSE 'Weekday'
END
AS day_type FROM rental;'''

In [16]:
query2 = '''SELECT *, MONTHNAME(rental_date) AS month, DAYNAME(rental_date) AS weekday, CASE WHEN dayname(rental_date) IN ('Saturday', 'Sunday') THEN 'Weekend'  ELSE 'Weekday' END AS day_type FROM rental;'''

In [17]:
data2 = pd.read_sql_query(query2, engine)
data2.head(1)

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,weekday,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,May,Tuesday,Weekday

In [20]:
# 3. Get all films with ARMAGEDDON in the title.

In [18]:
query3 = "SELECT * FROM film WHERE title LIKE '%%ARMAGEDDON%%';"

In [19]:
data3 = pd.read_sql_query(query3, engine)
data3.head(1)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,39,ARMAGEDDON LOST,A Fast-Paced Tale of a Boat And a Teacher who ...,2006,1,None,5,0.99,99,10.99,G,Trailers,2006-02-15 05:03:42

In [21]:
# 4. Get 10 the longest films.

In [22]:
query4 = "select title, length from film order by length desc limit 10;"

In [23]:
data4 = pd.read_sql_query(query4, engine)
data4.head(1)

            title  length
0  DARN FORRESTER     185

In [24]:
# 5. How many films include Behind the Scenes content?

In [27]:
query5 = "SELECT COUNT(title) FROM film WHERE special_features LIKE '%%Behind the Scenes%%';"

In [28]:
data5 = pd.read_sql_query(query5, engine)
data5.head(1)

   COUNT(title)
0           538

In [29]:
# 6. Which kind of movies (rating) have a mean duration of more than two hours?

In [30]:
query6 = '''SELECT      rating, ROUND(AVG(length), 2) AS avg_length FROM     film GROUP BY rating HAVING AVG(length) > 120;'''

In [31]:
data6 = pd.read_sql_query(query6, engine)
data6.head(1)

  rating  avg_length
0  PG-13      120.44

In [ ]:
# 7 . Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, 
# only select the columns title, length, and the rank

In [32]:
query7 = '''select title, length, dense_rank() over(order by length desc) as length_rank from film order by length desc;'''

In [33]:
data7 = pd.read_sql_query(query7, engine)
data7.head(1)

           title  length  length_rank
0  CHICAGO NORTH     185            1